---------------------------------------------------------------------------------------------------------------------------------------------------------------------------
      name:  <unnamed>
       log:  /Users/d/Dropbox (Personal)/4d.∫δυσφορία.dt,ψ/4.describe/note/age_o_age_e.log
  log type:  text
 opened on:  30 Jun 2023, 00:40:31

. import delimited "https://raw.githubusercontent.com/jhustata/livre/main/transplants.txt", clear
(encoding automatically selected: ISO-8859-1)
(26 vars, 2,000 obs)

. regress rec_hgt_cm gender 

      Source |       SS           df       MS      Number of obs   =     1,933
-------------+----------------------------------   F(1, 1931)      =    426.58
       Model |  70667.4243         1  70667.4243   Prob > F        =    0.0000
    Residual |  319890.062     1,931  165.660312   R-squared       =    0.1809
-------------+----------------------------------   Adj R-squared   =    0.1805
       Total |  390557.486     1,932  202.151908   Root MSE        =    12.871

------------------------------------------------------------------------------
  rec_hgt_cm | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
      gender |  -12.42026   .6013543   -20.65   0.000    -13.59963   -11.24089
       _cons |   173.4399   .3735802   464.26   0.000     172.7073    174.1726
------------------------------------------------------------------------------

. label define gender_lab 0 "Male" 1 "Female"

. label values gender gender_lab

. lincom _cons

 ( 1)  _cons = 0

------------------------------------------------------------------------------
  rec_hgt_cm | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
         (1) |   173.4399   .3735802   464.26   0.000     172.7073    174.1726
------------------------------------------------------------------------------

. g male_m=r(estimate)

. g male_lb= r(estimate) - e(rmse)*1.96

. g male_ub= r(estimate) + e(rmse)*1.96

. lincom _cons + gender 

 ( 1)  gender + _cons = 0

------------------------------------------------------------------------------
  rec_hgt_cm | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
         (1) |   161.0197   .4712375   341.70   0.000     160.0955    161.9439
------------------------------------------------------------------------------

. g female_m=r(estimate)

. g female_lb= r(estimate) - e(rmse)*1.96

. g female_ub= r(estimate) + e(rmse)*1.96

. twoway  ///
>    (scatter rec_hgt_cm gender if gender==0, ///
>       yti("Height, cm", ///
>              orientation(horizontal) ///
>           ) ///
>       text(210 0 "Male") ///
>           text(210 1 "Female") ///
>       legend(off) ///
>       mcolor(lime) ///
>           msymbol(oh) ///
>           jitter(30) ///
>    ) ///
>    (scatter rec_hgt_cm gender if gender==1, ///
>      xscale(off) ///
>      mcolor(lime) ///
>          msymbol(oh) ///
>      jitter(30) ///
>       xlab(-1(1)2 ///
>             -1 "" ///
>              0 "Male" ///
>                  1 "Female" ///
>                  2 "" ///
>           ) ///
>    ) ///
>    (scatter male_m gender if gender==0, ///
>       msize(2) ///
>           mcolor(blue) ///
>    )  ///
>    (scatter female_m gender if gender==1, ///
>       msize(2) ///
>           mcolor(blue) ///
>    )  ///
>    (rcap male_lb male_ub gender if gender==0, ///
>       lcolor(orange_red) ///
>    ) ///
>    (rcap female_lb female_ub gender if gender==1, ///
>       lcolor(orange_red) ///
>    ) 

. graph export twoway_hgt_gender.png, replace 
file /Users/d/Dropbox (Personal)/4d.∫δυσφορία.dt,ψ/4.describe/note/twoway_hgt_gender.png saved as PNG format

. log close 
      name:  <unnamed>
       log:  /Users/d/Dropbox (Personal)/4d.∫δυσφορία.dt,ψ/4.describe/note/age_o_age_e.log
  log type:  text
 closed on:  30 Jun 2023, 00:40:33
---------------------------------------------------------------------------------------------------------------------------------------------------------------------------
