---------------------------------------------------------------------------------------------------------------------------------------------------------------------------
      name:  <unnamed>
       log:  /Users/d/Dropbox (Personal)/4d.∫δυσφορία.dt,ψ/4.describe/note/z_of_diff_obs_exp.log
  log type:  text
 opened on:  25 Jun 2023, 09:03:56

. use transplants, clear

. sum age 

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
         age |      2,000      50.404    15.81062          0         85

. g age_th=rnormal(r(mean),r(sd))

. hist age, ///
>     fcolor(midblue%30) ///
>         addplot( ///
>             hist age_th, ///
>                     fcolor(orange%30) ///
>         ) ///
>         legend( ///
>             lab(1 "observed") ///
>                 lab(2 "expected") ///
>         )
(bin=33, start=0, width=2.5757576)

. graph export hist_obs_exp_overlap.png, replace 
file /Users/d/Dropbox (Personal)/4d.∫δυσφορία.dt,ψ/4.describe/note/hist_obs_exp_overlap.png saved as PNG format

. g diff=age-age_th

. regress diff

      Source |       SS           df       MS      Number of obs   =     2,000
-------------+----------------------------------   F(0, 1999)      =      0.00
       Model |           0         0           .   Prob > F        =         .
    Residual |  996804.334     1,999  498.651493   R-squared       =    0.0000
-------------+----------------------------------   Adj R-squared   =    0.0000
       Total |  996804.334     1,999  498.651493   Root MSE        =    22.331

------------------------------------------------------------------------------
        diff | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
       _cons |  -.2526796   .4993253    -0.51   0.613    -1.231932    .7265729
------------------------------------------------------------------------------

. sum diff

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
        diff |      2,000   -.2526796    22.33051  -82.78532   64.87444

. g z=diff/r(sd)

. kdensity z, addplot(normal)

. graph export z_of_diff_obs_exp.png, replace 
file /Users/d/Dropbox (Personal)/4d.∫δυσφορία.dt,ψ/4.describe/note/z_of_diff_obs_exp.png saved as PNG format

. log close 
      name:  <unnamed>
       log:  /Users/d/Dropbox (Personal)/4d.∫δυσφορία.dt,ψ/4.describe/note/z_of_diff_obs_exp.log
  log type:  text
 closed on:  25 Jun 2023, 09:03:59
---------------------------------------------------------------------------------------------------------------------------------------------------------------------------
